Тестовая_база_ERP_14/src/Tasks/РЭЙ_ЗадачиВЭД/РЭЙ_ЗадачиВЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>РЭЙ_ЗадачиВЭД</name>
  <addressing>InformationRegister.РЭЙ_РолиИИсполнители</addressing>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.РЭЙ_ВидыЗадачПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактВЭД</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗадачи</name>
    <type>
      <types>DocumentRef.РЭЙ_СправкаОВалютныхОперациях</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РЭЙ_СправкаОПодтверждающихДокументах</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортСделки</name>
    <type>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСправкиОВалютномКонтроле</name>
    <type>
      <types>EnumRef.РЭЙ_СтатусыСправокВалютногоКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗадачиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеРеквизиты</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РЭЙ_РолиИсполнителей</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

Тестовая_база_ERP_14/src/Enums/РЭЙ_СтатусыСправокВалютногоКонтроля/РЭЙ_СтатусыСправокВалютногоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РЭЙ_СтатусыСправокВалютногоКонтроля</name>
  <enumValues>
    <name>СправкаПодлежитСозданию</name>
  </enumValues>
  <enumValues>
    <name>СправкаПодлежитСдачеПослезавтра</name>
  </enumValues>
  <enumValues>
    <name>СправкаПодлежитСдачеЗавтра</name>
  </enumValues>
  <enumValues>
    <name>СправкаПодлежитСдачеСегодня</name>
  </enumValues>
  <enumValues>
    <name>СправкаПросрочена</name>
  </enumValues>
  <enumValues>
    <name>СправкаСоздана</name>
  </enumValues>
  <enumValues>
    <name>СправкаРаспечатана</name>
  </enumValues>
  <enumValues>
    <name>СправкаСозданаДокументПерезаписан</name>
  </enumValues>
  <enumValues>
    <name>СправкаРаспечатанаДокументПерезаписан</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Tasks/РЭЙ_ЗадачиВЭД/ObjectModule.bsl
Процедура ПередВыполнением()
	Если Исполнитель.Пустая() Тогда
		Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если Ссылка.СтатусСправкиОВалютномКонтроле <> СтатусСправкиОВалютномКонтроле Тогда
		ДатаИзмененияСтатуса = ТекущаяДата();
	КонецЕсли;
	
	Если ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.РЭЙ_КонтрактыВЭД") Тогда
		КонтрактВЭД = ОбъектЗадачи;
	Иначе
		КонтрактВЭД = ПаспортСделки.КонтрактВЭД;
	КонецЕсли;

	Если ЗначениеЗаполнено(ОбъектЗадачи) Тогда
		Если ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.РЭЙ_КонтрактыВЭД") Тогда
			ОбъектЗадачиПредставление = ОбъектЗадачи.Наименование;
		Иначе
			ОбъектЗадачиПредставление = РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(ОбъектЗадачи);
		КонецЕсли
	Иначе
		ОбъектЗадачиПредставление = "";
	КонецЕсли; 
	
	Если СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСозданию Тогда
		ИндексКартинки = 0;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеЗавтра Тогда
		ИндексКартинки = 1;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеПослезавтра Тогда
		ИндексКартинки = 2;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеСегодня Тогда
		ИндексКартинки = 3;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПросрочена Тогда
		ИндексКартинки = 4;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаСоздана Тогда
		ИндексКартинки = 5;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаРаспечатана Тогда
		ИндексКартинки = 6;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаСозданаДокументПерезаписан Тогда
		ИндексКартинки = 7;
	ИначеЕсли СтатусСправкиОВалютномКонтроле = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаРаспечатанаДокументПерезаписан Тогда
		ИндексКартинки = 8;
	КонецЕсли; 
КонецПроцедуры
